Repository: dev-xiligroup/xili-dictionary-plugin
Catalog: xili-dictionary/languages/xili-dictionary-*.po
Languages: fr_fr

source: When the selection is successful, click prepare and the link for download appears in the green message space under the title.
fr_fr: Quand la sélection est conforme, cliquer le bouton Préparer et le lien pour télécharger apparaît dans le message sous le titre.

source: About %s dictionary download files
fr_fr: Concerne le téléchargement des fichiers dans %s dictionary

source: Docs about xili-dictionary
fr_fr: Docs sur le dictionnaire xili©

source: xili-dictionary updated
fr_fr: nouvelle version de xili-dictionary

source: xili-dictionary was updated to version %s
fr_fr: xili-dictionary vient d’être mise à jour en version %s

source: This new version %s is compatible with WP 5.2 and XL 2.23+ able to import parent sources if child theme active, writers are displayed in list, also compatible with Polylang taxonomy and xml importing.
fr_fr: La nouvelle version %s est compatible avec WP 5.2 and XILI-LANGUAGE 2.23 capable d’importer des sources parent si le thème enfant est actif, les rédacteurs sont affichés dans une liste, également compatible avec la taxonomie Polylang et l’importation xml.

source: In previous version of %s, if you switch language of dashboard is other than in en_US, then the import process of sources msgid will try to import translations of chosen language.
fr_fr: Dans la précédente version %s, si au lieu du <em>en_US</em>, vous changez la langue du tableau de bord, alors le processus va essayer d’importer les traductions disponibles dans le langage choisi.

source: See submenu
fr_fr: Voir le menu

source: Tools, Files po mo
fr_fr: Outils, Fichiers po mo

source: Before to question dev.xiligroup support, do not forget to visit %s documentation
fr_fr: Avant de questionner le support dev.xiligroup, n’oubliez pas de cocher les infos du site et de lire la doc. sur %s

source: No translations saved in theme's .mo files
fr_fr: Non traduit dans les .mo du thème

source: Original with translations saved in theme's files:
fr_fr: Original avec traductions dans les .mo du thème :

source: No translations saved in site's .mo files
fr_fr: Non traduit dans les .mo du thème

source: Original with translations saved in site's files:
fr_fr: Original avec traductions dans les .mo du thème :

source: Not yet translated in any language (not in any .mo files)
fr_fr: Non traduit et disponible dans les .mo du site

source: Translated in
fr_fr: Traduit en

source: Scanning source files of current theme or plugins
fr_fr: Explorer les fichiers source du thème courant ou des extensions

source: Start scanning
fr_fr: Lancer l'extraction

source: Importing files (.po, .pot, .mo)
fr_fr: Importation de fichiers (.po, .pot, .mo)

source: Start importing
fr_fr: Lancer l’importation

source: this theme
fr_fr: du thème

source: parent of this theme
fr_fr: parent de ce thème

source: this plugin
fr_fr: de l'extension

source: Start importing from parent theme
fr_fr: Importer à partir du thème parent

source: Importing the files
fr_fr: Importer les fichiers

source: Define the file to import
fr_fr: Définition du fichier à importer

source: Scanning the files
fr_fr: Fichiers en cours d'examen

source: Define the sources
fr_fr: Définir les sources

source: These settings below are reserved for future uses, leave values 'as is'.
fr_fr: Ces réglages ci-dessous sont réservés à un usage ultérieur, laisser les 'tel-quel'.

source: Here it is possible to scan the source files and import translatable terms inside the dictionary.
fr_fr: Il est ici possible d'explorer les fichiers source et d'importer les éléments traduisibles dans le dictionnaire.

source: Before importing terms, verify that the %1$strash%2$s is empty !
fr_fr: Avant d'importer des termes, vérifier que la %1$scorbeille%2$s est vide !

source: Here it is possible to import the .%s file inside the dictionary.
fr_fr: Il est ici possible d'importer un fichier .%s dans le dictionnaire.

source: Type of file: .mo or .po
fr_fr: Type de fichier: .mo or .po

source: Folder
fr_fr: Dossier

source: Site file (blogs.dir)
fr_fr: Fichier du site (blogs.dir)

source: Original theme file
fr_fr: Fichier du thème original

source: As superadmin, define origin of file
fr_fr: En tant que superadmin, définir l'origine du fichier

source: Place of msgs file
fr_fr: Emplacement des fichiers de msgs

source: xx_XX file in theme
fr_fr: fichier xx_XX dans le dossier du theme

source: local-xx_XX file in theme
fr_fr: fichier local-xx_XX dans le dossier du thème

source: xx_XX file in parent theme
fr_fr: fichier xx_XX dans le dossier du theme parent

source: %1$s-xx_XX in %2$s
fr_fr: %1$s-xx_XX dans %2$s

source: language file from a plugin
fr_fr: fichier langue d’une extension

source: language file from a plugin in %1$s
fr_fr: fichier langue d’une extension dans %1$s

source: Define folder where is file.
fr_fr: Choisir le dossier du fichier.

source: Select the plugin from where to import language file.
fr_fr: Choix de l’extension de laquelle importer le fichier langue.

source: Each line includes Text Domain (if available in plugin sources header) and state of plugin.
fr_fr: Pour chaque extension, est indiqué (si disponible dans l'entête des sources) le Text Domain et son état actif ou non.

source: Language of the file or POT type if available in theme's folder when importing .po file. Submit button is active if file exists!
fr_fr: Langue du fichier ou fichier type POT si dispo dans le dossier du thème (en cas d'importation de type .po). Le bouton Lancer est actif si le fichier existe !

source: Plugin
fr_fr: Extension

source: Select the plugin
fr_fr: Choisir l’extension

source: n. a.
fr_fr: n. d.

source: Name of current source
fr_fr: Nom de la source

source: Used to assign origin taxonomy. Below the state of the wanted file:
fr_fr: Utilisé pour affecter la taxinomie Origine. Ci-dessous l'état du fichier ciblé :

source: What about comments
fr_fr: En ce qui concerne les commentaires

source: No change
fr_fr: Sans changement

source: Imported comments replace those in list
fr_fr: Les commentaires importés remplacent les anciens

source: Imported comments be appended...
fr_fr: Les commentaires importés sont ajoutés...

source: Place of source files
fr_fr: Lieu des fichiers source

source: from the current theme
fr_fr: du thème courant

source: from the current parent theme (%s)
fr_fr: du thème parent courant (%s)

source: from a selected plugin
fr_fr: d’une extension à choisir

source: Define where to scan files.
fr_fr: Choisir les sources à explorer.

source: Select the plugin from where to scan translatable term.
fr_fr: Choix de l’extension de laquelle importer les éléments traduisibles.

source: What about found msgid ?
fr_fr: En ce qui concerne les msgid trouvés ?

source: only import in dictionary
fr_fr: ne les importer que dans le dictionnaire

source: only import in a POT file
fr_fr: ne les importer que dans le fichier .pot

source: import and backup in POT
fr_fr: importer et copier dans le fichier pot

source: File %3$s%2$s.%1$s found ! (%4$s entries)
fr_fr: Fichier %3$s%2$s.%1$s trouvé ! (%4$s entrées)

source: Found %1$s entries in sources of %2$s
fr_fr: %1$s entrées trouvées dans les sources du %2$s

source: Impossible to find file %3$s%2$s.%1$s (%4$s)
fr_fr: Impossible de trouver le fichier %3$s%2$s.%1$s (%4$s)

source: Impossible to find entries in sources of %1$s
fr_fr: Impossible de trouver des entrées dans les sources du %1$s

source: msgs only in pot file
fr_fr: les msgids sont sauvés uniquement dans le fichier .pot

source: No msgs to import
fr_fr: Pas de msgs à importer

source: Importing msgs (%1$s - %2$s)
fr_fr: Importation des msgs en cours (%1$s - %2$s)

source: Importation Complete
fr_fr: Importation terminée

source: from plugin: %s
fr_fr: de l'extension : %s

source: from theme: %s
fr_fr: du thème : %s

source: POT file updated
fr_fr: Fichier POT mis à jour

source: POT file infos
fr_fr: Infos sur le fichier POT

source: Starting Importing
fr_fr: Démarrer l'importation

source: Go to the list of msgs:
fr_fr: Voir la liste des msgs:

source: Continue
fr_fr: Poursuivre

source: Starting Erasing
fr_fr: Suppression lancée

source: View all origins
fr_fr: Voir toutes les origines

source: Content
fr_fr: Contenu

source: Type / Origin
fr_fr: Type & Origine

source: No writer found
fr_fr: Pas de rédacteur trouvé

source: Writer
fr_fr: Rédacteur

source: Writers
fr_fr: Rédacteurs

source: : %s
fr_fr: &nbsp;: %s

source: Plugin:
fr_fr: Extension :

source: <small>From:</small> %s
fr_fr: <small>De :</small> %s

source: View all languages
fr_fr: Voir toutes les langues

source: msg
fr_fr: msg (id ou str)

source: the entry with the %s
fr_fr: l’entrée avec ses %s

source: List of %s from entries to translate
fr_fr: Liste de %s avec les entrées à traduire

source: Shortcuts to update mo files
fr_fr: Raccourcis pour mettre à jour les fichiers .mo

source: MO file updating started: see result in meta-box named - Shortcuts... - below buttons
fr_fr: Mise à jour du fichier MO lancée : voir le message résultant dans la boite - Raccourcis… - sous les boutons

source: Local MO updating started: see result in meta-box named - Shortcuts... - below buttons
fr_fr: Mise à jour du fichier Local MO lancée : voir le message résultant dans la boite - Raccourcis… - sous les boutons

source: Error with File %s !
fr_fr: Erreur avec le fichier %s !

source: File %1$s updated with %2$s msgids
fr_fr: Fichier %1$s mis à jour avec %2$s msgids

source: Nothing modified in %s, file not updated
fr_fr: Rien de modifié dans %s, fichhier non mis à jour

source: MSGs not translated in %1$s. <em>Sub-select in %2$s</em>
fr_fr: MSGs non traduits en %1$s. <em>Choisir ceux non traduits en %2$s</em>

source: No selection: Sub-select in %s
fr_fr: Pas de sélection : Choisir selon %s

source: Text
fr_fr: Texte

source: .mo status
fr_fr: état des .mo

source: All lines
fr_fr: Tous

source: First
fr_fr: Début

source: Last page
fr_fr: Fin

source: Next
fr_fr: Suiv.

source: Previous
fr_fr: Préc.

source: Showing (_START_ to _END_) of _TOTAL_ entries
fr_fr: Affiche (_START_ à _END_) des _TOTAL_ lignes

source: (filtered from _MAX_ total entries)
fr_fr: (filtrés du total des _MAX_ lignes)

source: Empty table
fr_fr: Dictionnaire de msg vide !

source: No entry
fr_fr: Aucune ligne

source: Show _MENU_ entries
fr_fr: Afficher _MENU_ lignes

source: Filter msg:
fr_fr: Filtrer les msg :

source: Informations and actions about files .po / mo
fr_fr: Informations et actions à propos des fichiers .po / mo

source: Come from:
fr_fr: Origine :

source: Not yet assigned
fr_fr: Non affecté

source: theme folder %s
fr_fr: dossier du thème %s

source: this site
fr_fr: ce site

source: folder %s
fr_fr: dossier %s

source: saved in
fr_fr: sauvé dans

source: Plugin ( %s ):
fr_fr: Extension (%s):

source: XD say to translate in %s:
fr_fr: XD indique de traduire en %s :

source: XD say id to plural:
fr_fr: XD indique id au plural:

source: Edit
fr_fr: Modifier

source: &nbsp;<a href="%s" >Create msgid_plural</a>
fr_fr: &nbsp;<a href="%s" >Créer msgid_plural</a>

source: translated in
fr_fr: traduit en

source: Create msgstr in:
fr_fr: Créer un msgstr :

source: Create and edit
fr_fr: Créer et éditer

source: not yet translated.
fr_fr: non traduit.

source: Status: %s
fr_fr: Statut : %s

source: Translation in
fr_fr: Traduction en

source: The msgid (%d) was deleted. The msg series must be recreated.
fr_fr: Le msgid (%d) est effacé. La série doit être re-créée.

source: P{%s}:
fr_fr: E{%s}&nbsp;:

source: Context
fr_fr: Contexte

source: &nbsp;<a href="%s" >Edit context</a>
fr_fr: &nbsp;<a href="%s" >Modifier le contexte</a>

source: &nbsp;<a href="%s" >Create context</a>
fr_fr: &nbsp;<a href="%s" >Créer un contexte</a>

source: After saving this msgid as draft,%s it will be possible to add a context
fr_fr: Après enregistrement comme brouillon, %s il sera alors possible d'ajouter un contexte

source: Return to %s list
fr_fr: Retour à la liste %s

source: Extracted comments: %s
fr_fr: Commentaires extraits : %s

source: Translator comments: %s
fr_fr: Commentaires traducteur : %s

source: Flags: %s
fr_fr: Drapeaux : %s

source: msgstr Translator comments
fr_fr: Commentaire traducteur msgstr

source: Lines: %s
fr_fr: Lignes : %s

source: Return to <a href="%s" title="Go to msg list">msg list</a>
fr_fr: Retour à la <a href="%s" title="Aller à la liste msg">liste msg</a>

source: Set in theme (<a href="%s" >set local</a>)
fr_fr: Mis dans le thème (<a href="%s" >mettre en local</a>)

source: Set in local (<a href="%s" >unset</a>)
fr_fr: Affecté en local (<a href="%s" >désaffecter</a>)

source: The msgid (%d) was deleted. The msg series must be recreated and commented.
fr_fr: Le msgid (%d) a été effacé. La série des msgs doit être récréée et commentée.

source: This msg translation is in %1$s (%2$s)
fr_fr: Ce msg traduit en %1$s (%2$s)

source: Updating shortcuts
fr_fr: Raccourcis de mise à jour

source: Update
fr_fr: Mettre à jour

source: No local translated msgid to be saved in %s
fr_fr: Pas de msgid 'local' à sauver dans %s

source: It is possible to update the .mo files of current theme %s
fr_fr: Il est possible de mettre à jour les fichiers .mo du thème courant %s

source: Before to use this button, it is very important that you verify that your term list is quite achieved inside the dictionary. It is because the original .mo delivered with theme is updated (erased) !!!
fr_fr: Avant d'utiliser ce bouton, il est très important de vérifier que la liste des termes (msg) est presque achevée dans le dictionnaire. En effet, le fichier original livré avec le thème est écrasé. Donc pensez à les importer dans le dictionnaire auparavant !!!

source: No translated msgid to be saved in %s
fr_fr: Pas de msgid à sauver dans %s

source: Links are available if a translation (msgstr) is edited.
fr_fr: Les raccourcis sont disponibles si une traduction (msgstr) est en cours.

source: Are you sure you want to update mo ?
fr_fr: Etes vous sûr de vouloir mettre à jour le .mo ?

source: No translations saved in theme’s .mo files
fr_fr: Pas de traduction sauvé dans les fichiers .mo du thème

source: Original with translations saved in theme’s files:
fr_fr: Traductions présentes dans les fichiers du site :

source: No translations saved in local-xx_XX .mo files
fr_fr: Non traduit dans les local-xx_XX.mo du thème

source: Original with translations saved in local-xx_XX files:
fr_fr: Original avec traductions dans les local-xx_XX.mo du thème :

source: No translations saved in site’s .mo files
fr_fr: Non traduit dans les .mo du site

source: No translations saved in site’s local .mo files
fr_fr: Non traduit dans les local-xx_XX.mo du thème

source: Original with translations saved in site’s local files:
fr_fr: Original avec traductions dans les local-xx_XX.mo du thème :

source: Dialog box
fr_fr: Boite de dialogue

source: Do &raquo;
fr_fr: Ajouter&raquo;

source: Cancel
fr_fr: Annuler

source: Build mo file
fr_fr: Générer le fichier mo

source: To build a %s file, choose language, destination (current theme or plugin) and origin.
fr_fr: Pour construire le fichier %s, choisir la langue, la destination (thème courant ou extension) et l'origine.

source: Build %s file &raquo;
fr_fr: Générer le fichier %s &raquo;

source: error during exporting in %s file.
fr_fr: Erreur pendant la création du fichier %s.

source: exported in %1$s file with %2$s msgids.
fr_fr: exporté dans le fichier %1$s avec %2$s msgids.

source: Nothing saved or updated in %s file !
fr_fr: Rien de sauvé dans %s, pas de mise à jour !

source: Build po file
fr_fr: Générer le fichier po

source: Import terms of blog info and others…
fr_fr: Importer les termes des infos du site…

source: To import terms of blog info and others defining this current website (title, date, comment, archive...), click below.
fr_fr: Pour importer les termes du thème courant (titre, sous-titre, dates, commentaires, archives etc...), cliquer ci-dessous.

source: The process will import around 140 <strong>msgid</strong> from db and sources, so be patient.
fr_fr: Le processus lancé va importer près de 140 <strong>msgid</strong> de la base et des sources, soyez donc patient.

source: The language of dashboard is not <em>en_US</em>, so the process will try to import translations in %s.
fr_fr: Le langage du tableau de bord n'est pas <em>en_US</em>, dès lors, le processus va essayer d’importer les traductions par défaut en %s.

source: If you switch language of dashboard in one other than in <em>en_US</em>, then the process will try to import translations of chosen language.
fr_fr: Si, au lieu du <em>en_US</em>, vous changez la langue du tableau de bord, alors le processus va essayer d’importer les traductions disponibles dans le langage choisi.

source: Import blog info terms &raquo;
fr_fr: Importer tous les termes &raquo;

source: Import terms from active plugins
fr_fr: Importer les termes des extensions actives

source: To import terms …, click below.
fr_fr: Pour importer les termes ..., cliquer ci-dessous.

source: Import msgs &raquo;
fr_fr: Importer les msgs &raquo;

source: Start collecting terms from active plugins
fr_fr: Importer les termes des extensions actives

source: To import terms, open a browser in front-end side.
fr_fr: Pour importer les termes du thème courant, ouvrir un navigateur sur le côté visiteur du site.

source: Stop msgs collecting &raquo;
fr_fr: Arrêt de la collecte des msgs &raquo;

source: Error: no domain specified
fr_fr: Erreur : pas de domaine spécifié

source: Please specify a domain...
fr_fr: Indiquer un domain...

source: End collecting &raquo;
fr_fr: Fin de collecte &raquo;

source: Import collected &raquo;
fr_fr: Importer les éléments collectés &raquo;

source: imported terms =
fr_fr: termes importés =

source: plugin’s terms pbs!
fr_fr: problème dans les termes de l'extension !

source: Import terms of taxonomy
fr_fr: Importer les noms et descriptions des taxinomies

source: To import terms of the current taxonomy named, click below.
fr_fr: Pour importer les termes du thème courant, cliquer çi-dessous.

source: Import taxonomy’s terms &raquo;
fr_fr: Importer &raquo;

source: taxonomy -%s- terms pbs!
fr_fr: problème avec les termes de la taxinomie -%s- !

source: taxonomy -%s- do not exists
fr_fr: la taxinomie -%s- n'existe pas

source: Erase all terms
fr_fr: Effacer tous les termes

source: To erase terms of the dictionary, click below. (before, create a .po if necessary!)
fr_fr: Efface tous les termes du dictionnaire ! mais pas les fichiers .po et .mo

source: Erase all terms &raquo;
fr_fr: Effacer le dictionnaire &raquo;

source: All terms erased !
fr_fr: Tous les termes effacés !

source: Email sent.
fr_fr: Courriel envoyé.

source: Thanks for your email. A copy was sent to %1$s (%2$s)
fr_fr: Merci pour votre courriel dont une copie est envoyé à %1$s (%2$s)

source: Find below the list of msg.
fr_fr: Voici ci-dessous la liste des msg.

source: Import & export
fr_fr: Importer et exporter

source: Terms list management
fr_fr: Gestion de l'affichage des termes (msg)

source: Languages list management
fr_fr: Gestion de la liste des langues

source: Entries (Msgid and Msgstr)
fr_fr: Entrées (msgid / msgstr)

source: A new msgid was added.
fr_fr: Un nouveau msgid a été ajouté.

source: A msg was updated.
fr_fr: Un msg mis à jour.

source: A msg was deleted.
fr_fr: Un msg a été supprimé.

source: msg imported from WP:
fr_fr: msg importés de WP :

source: All msg imported !
fr_fr: Tous les msg importés !

source: Result log: %s
fr_fr: Message : %s

source: All msgs erased !
fr_fr: Tous les msg effacés !

source: Error when adding !
fr_fr: Erreur à la création !

source: Error when updating !
fr_fr: Erreur lors de la mise à jour !

source: Wait during terms importing process until the entries (msgid and msgstr) list appears below!
fr_fr: Patienter pendant le processus de l’importation des textes jusqu’à l’affichage ci-dessous de la liste des entrées (msgid et msgstr) !

source: Dictionary
fr_fr: Dictionnaire

source: msgid imported with success (%s msgstr)
fr_fr: msgid importés avec succès (%s msgstr)

source: already imported
fr_fr: déjà importé

source: Polylang imported or refreshed (%1$s) - and %2$s category strings.
fr_fr: Importation ou actualisation (%1$s) de Polylang effectuée et %2$s textes des catégories.

source: Author
fr_fr: Auteur

source: Build a .pot file
fr_fr: Générer un fichier .pot

source: Verify before that you are authorized to write in languages folder in theme named: %s
fr_fr: Avant: vérifier que vous êtes bien habilité à modifier les fichiers langues dans le thème dénommé %s

source: SuperAdmin: %sonly as theme .mo
fr_fr: En tant que Super Admin : %smodifier le .mo du thème original

source: SuperAdmin: %sonly as theme .po
fr_fr: En tant que Super Admin : %smodifier le .mo du thème original

source: Theme
fr_fr: Thème courant

source: Build and save %s file
fr_fr: Générer le fichier %s

source: Save only the local-xx_XX.%s sub-selection
fr_fr: Sauver seulement la sous -sélection local-xx_XX.%s

source: Save %s w/o local msgs
fr_fr: Sauve %s en excluant les messages (msg) “local”

source: In which languages subfolder
fr_fr: Vers quel sous-dossier langages

source: Sub-folder (%1$s) in current theme (%2$s)
fr_fr: Sous-dossier (%1$s) du thème courant (%2$s)

source: Languages sub-folder (%1$s) in parent theme ( %2$s )
fr_fr: Sous-dossier langues (%1$s) du thème parent ( %2$s )

source: Themes sub-folder in wp-content/languages (WP_LANG_DIR)
fr_fr: Sous-dossier themes de wp-content/languages (WP_LANG_DIR)

source: Plugin language folder
fr_fr: Sous-dossier langages de l'extension

source: Plugin language file in %s
fr_fr: fichier langue d’une extension dans %s

source: Check Origin(s) to be exported
fr_fr: Cocher selon les origines à exporter

source: Plugin: %s
fr_fr: L’extension : %s

source: The previous file will be overwritten !
fr_fr: Le fichier actuel sera remplacé !

source: Slug:
fr_fr: Code :

source: Some active domains are detected in memory
fr_fr: Plusieurs domaines actifs sont détectés en mémoire.

source: This domain named %1$s has %2$d active entries.
fr_fr: Ce domaine dénommé %1$s a %2$d entrées.

source: Some terms collected from %s !
fr_fr: Quelques éléments collectés de %s !

source: No terms collected from %s !
fr_fr: Pas d'élément importé de %s !

source: Domain :
fr_fr: Domaine :

source: Now, all the blog and core terms are imported:
fr_fr: C'est terminé, tous les termes du coeur et options du site sont importés :

source: This box is used for input dialog, leave it opened and visible…
fr_fr: Cette fenêtre est utilisée pour le dialogue : laisser visible et ouverte…

source: Drawing table...
fr_fr: Tableau en cours de mise en place...

source: Language to delete
fr_fr: Langue à supprimer

source: Only the languages list is here modified (but not the dictionary's contents)
fr_fr: Seule la liste des langages est modifiée mais pas les contenus du dictionnaire

source: Select...
fr_fr: Choisir...

source: Delete a language
fr_fr: Supprimer une langue

source: Language to add
fr_fr: Langue à ajouter

source: ISO (xx_YY)
fr_fr: Code (xx_YY)

source: Name (eng.)
fr_fr: Nom (angl.)

source: Add a language
fr_fr: Ajouter une langue

source: Choose…
fr_fr: Choisir…

source: The files
fr_fr: Les fichiers

source: Create or Update mo file in current theme folder
fr_fr: Crée ou met à jour le fichier .mo dans le dossier du thème actif

source: Import po/mo file
fr_fr: Import d'un fichier

source: Import an existing .po file from current theme folder
fr_fr: Importe un fichier .po existant dans le dossier du thème actif

source: Import an existing .mo file from current theme folder
fr_fr: Importe un fichier .po existant dans le dossier du thème actif
