Repository: dev-xiligroup/xili-dictionary-plugin
Catalog: xili-dictionary/languages/xili-dictionary-*.po
Languages: fr_fr

source: Create or Update po file in current theme folder
fr_fr: Crée ou met à jour le fichier .po dans le dossier du thème actif

source: Download po or file to your computer
fr_fr: Télécharger le fichier po sur votre ordinateur

source: Download file
fr_fr: Télécharger le fichier

source: The taxonomies
fr_fr: Les taxinomies du site.

source: Import name and description of taxonomy
fr_fr: Importe nom et description des taxinomies

source: Import texts of taxonomy
fr_fr: Importer des textes des taxonomies

source: The website infos (title, sub-title and more…)
fr_fr: Les infos du site (titre, sous-titre etc…)

source: …and comment, locale, date terms, archive,…
fr_fr: … et les termes pour commentaires, locaux et dates ainsi que ceux pour les archives.

source: Import infos of website and more to become translatable...
fr_fr: Importer des infos du site Web et bien plus encore pour devenir traduisible…

source: Import texts of website's infos
fr_fr: Importer des textes d’infos du site

source: Dictionary in database
fr_fr: Le dictionnaire dans la base

source: Erase selected msg of dictionary ! (but not .mo or .po files)
fr_fr: Effacer une sélection ou tous les msg du dictionnaire ! (les fichiers .mo et .po ne sont pas effacés)

source: Erase (selection of) msg
fr_fr: Effacer (une sélection) des msg &raquo;

source: Import translatable texts from files
fr_fr: Importer les textes traduisibles des fichiers

source: Import texts from source files
fr_fr: Importer les textes traduisibles des fichiers source

source: Selection of plugin’s msgs for front-end
fr_fr: Sélection des extensions pour le versant visiteur

source: Import translatable texts for current active plugin
fr_fr: Importer les textes des fichiers d’une extension active

source: Import texts from plugins
fr_fr: Importer les textes des extensions

source: Sub list of msg
fr_fr: Sélection de msg

source: Containing:
fr_fr: Incluant :

source: Sub select…
fr_fr: Sous sélectionner…

source: No select…
fr_fr: Sans sélection…

source: Selection by language
fr_fr: Sélection par langue

source: No sub-selection
fr_fr: Sans sous-sélection

source: Only MsgID (en_US)
fr_fr: Que le MsgID (en_US)

source: child of
fr_fr: enfant de

source: A config.xml file is available.
fr_fr: Un fichier config.xml est disponible.

source: Check below if you want to add in dictionary the terms described inside this file. <br />(Do not forget to fill values in customizer before.)
fr_fr: Cocher ci-dessous pour ajouter dans le dictionnaire les termes décrits dans ce fichier. <br />(Ne pas oublier auparavant de saisir ces valeurs dans l’écran de personnalisation.)

source: import theme_mods datas
fr_fr: importer les données theme_mods

source: BUT current PHP install needs <em>simplexml</em> extension !
fr_fr: MAIS le PHP courant nécessite l’extension <em>simplexml</em> !

source: Polylang translation strings are available.
fr_fr: Les chaînes de traduction de Polylang sont disponibles.

source: Check below if you want to add in dictionary the terms (and translations) made by Polylang
fr_fr: Cochez ci-dessous si vous souhaitez ajouter dans le dictionnaire les termes (et traductions) faites par Polylang

source: import Polylang strings
fr_fr: importer les textes de Polylang

# post type general name
source: xili-dictionary©
fr_fr: Dictionnaire xili©

source: New Msgid
fr_fr: Ajout msgid

source: Add New Msgid
fr_fr: Ajout msgid

source: Edit Msg
fr_fr: Editer le msg

source: New Msg
fr_fr: Nouveau msg

source: View Msg
fr_fr: Afficher

source: Search Msg
fr_fr: Chercher msg

source: No Msg found
fr_fr: Pas de msg trouvé

source: No Msg found in Trash
fr_fr: Pas de msg dans la poubelle

source: Origins
fr_fr: Origines

source: Origin
fr_fr: Origine

source: Search Origins
fr_fr: Chercher des origines

source: Popular Origins
fr_fr: Origines fréquentes

source: All Origins
fr_fr: Toutes les origines

source: Parent Origin
fr_fr: Origine parente

source: Parent Origin:
fr_fr: Origine parente :

source: Edit Origin
fr_fr: Modifier l'origine

source: Update Origin
fr_fr: Mettre à jour cette origine

source: Add New Origin
fr_fr: Ajouter une nouvelle origine

source: New Origin Name
fr_fr: Nouveau nom de l'origine

source: Separate origins with commas
fr_fr: Séparer les origines avec une virgule

source: Add or remove origins
fr_fr: Ajouter ou supprimer des origines

source: Choose from the most used origins
fr_fr: Choisir parmi les origines les plus fréquentes

source: No origin found
fr_fr: Pas d’origine trouvée

source: Search Writers
fr_fr: Recherche Rédacteurs

source: Popular Writers
fr_fr: Rédacteurs fréquents

source: All Writers
fr_fr: Tous les rédacteurs

source: Parent Writer
fr_fr: Parent du rédacteur

source: Parent Writer:
fr_fr: Parent du rédacteur :

source: Edit Writer
fr_fr: Modifier un rédacteur

source: Update Writer
fr_fr: Mettre à jour un rédacteur

source: Add New Writer
fr_fr: Ajouter un nouveau rédacteur

source: New Writer Name
fr_fr: Nouveau nom de rédacteur

source: Separate writers with commas
fr_fr: Séparer les rédacteurs avec une virgule

source: Add or remove writers
fr_fr: Ajouter ou supprimer des rédacteurs

source: Choose from the most used writers
fr_fr: Choisir parmi les rédacteurs les plus fréquents

source: series
fr_fr: Série

source: Reference
fr_fr: Référence

source: This text (msgid) is the Reference and must modified <strong>ONLY IF</strong> you are sure that it will be the same as in source code or text.
fr_fr: Ce texte (msgid) est LA référence et ne doit être modifié <strong>QUE SI</strong> vous êtes sûr qu'il correspondra bien avec celui du code source ou de texte ciblé.

source: To create or edit translations (msgstr), see %1$s in the table of box %2$s.
fr_fr: Pour créer ou éditer (msgstr), voir %1$s dans la table de la boite %2$s.

source: links
fr_fr: liens

source: msg %s
fr_fr: %s msg

source: &nbsp;(plural)
fr_fr: &nbsp;(pluriel)

source: Translation%s
fr_fr: Traduction%s

source: A term with the name provided already exists.
fr_fr: Le terme avec ce même nom existe.

source: and context %s
fr_fr: avec le contexte %s

source: msgid exists as %1$d with content: %2$s%3$s
fr_fr: le msgid existe dans %1$d tel que : %2$s%3$s

source: without context
fr_fr: sans contexte (ctxt)

source: Name
fr_fr: Nom

source: <a href="%s">Display term(s) in XD</a>
fr_fr: <a href="%s" >Afficher dans XD</a>

source: This list above gathers the translations of name and description saved in current local-xx_XX.mo files of the current theme.
fr_fr: La liste ci-dessus regroupe les traductions des noms et descriptions présentes dans xili-dictionary et les fichiers local-xx_XX.mo du thème courant.

source: View all writers
fr_fr: Voir tous les rédacteurs

source: msgid saved as: <em>%s</em>
fr_fr: msgid stocké : <em>%s</em>

source: has plural:
fr_fr: a un plural :

source: XD say to translate in %s:
fr_fr: XD indique de traduire en %s :

source: msgid plural of: <strong>%s</strong> ( <a href="%s" title="link to:%d" >%s</a> )<br />
fr_fr: msgid plural de : <strong>%s</strong> ( <a href="%s" title="lien vers :%d" >%s</a> )<br />

source: msgid plural of: <a href="%s" >%d</a><br />
fr_fr: msgid plural de : <a href="%s" >%d</a><br />

source: go to <a href="%1$s" title="link to:%2$d">msgid</a>
fr_fr: pointer le <a href=“%1$s" title="lien vers :%2$d">msgid</a>

source: Xili Dictionary
fr_fr: Dictionnaire xili™

source: Msg list
fr_fr: Liste msg

source: XD Msg list
fr_fr: Liste XD msg

source: XD settings
fr_fr: Réglages XD

source: Mail & Support
fr_fr: Courriel et support

source: Settings
fr_fr: Réglages

source: not translated in
fr_fr: non traduit en

source: WARNING: xili-dictionary datas are not ready to be imported from XML generated here. <br />So, it is fully recommended to <strong>desactivate temporarily xili-dictionary</strong> during export and so, avoid clutter of the file.
fr_fr: ATTENTION : Les données de xili-dictionary ne sont pas prêtes à être importées à partir du fichier XML généré ici. <br/> Aussi il est vivement recommandé de <strong>désactiver temporairement l'extension xili-dictionary</strong> pendant l'exportation et éviter ainsi un fichier encombré.

source: To export/import/backup dictionary datas, use .po files built by the plugin.
fr_fr: Pour sauvegarder/exporter/importer les donnés du dictionnaire, utiliser la génération des fichiers .po avec l'extension.

source: Erasing
fr_fr: Suppression en cours

source: Erase
fr_fr: Supprimer

source: Importing files
fr_fr: Importation en cours du fichier

source: Import
fr_fr: Importer

source: Downloading files to your computer
fr_fr: Télécharger les fichiers dans votre ordinateur

source: Download
fr_fr: Télécharger
