Repository: dev-xiligroup/xili-dictionary-plugin
Catalog: xili-dictionary/languages/xili-dictionary-*.po
Languages: fr_fr

source: xd-style.css is in sub-folder xili-css of current theme folder
fr_fr: xd-style.css est dans le sous-dossier xili-css du thème courant

source: xd-style.css is in sub-folder xili-css of %s folder
fr_fr: xd-style.css est dans le sous-dossier xili-css du dossier %s

source: xd-style.css is in sub-folder xili-css of xili-dictionary plugin folder (example)
fr_fr: xd-style.css est dans le sous-dossier xili-css de l’extension xili-dictionary (exemple à ne pas modifier)

source: no xd-style.css
fr_fr: pas fichier xd-style.css

source: xili-language-ms is active !
fr_fr: xili-language multisite est actif !

source: xili-language plugin is not present !
fr_fr: L'extension xili-language n’est pas présente !

source: xili-language plugin is not activated !
fr_fr: L'extension xili-language n'est pas activée !

source: Theme’s informations:
fr_fr: A propos du thème :

source: Languages sub-folder:
fr_fr: Sous-dossier langages :

source: No languages files are present in theme's folder or theme's sub-folder: <strong>add at least a .po or a .mo inside.</strong><br /> Errors will occur if you try to import or export!
fr_fr: Aucun fichier de langues détectés dans le dossier (ou sous-dossier) du thème ! <strong>déposer y au moins un fichier .po or a .mo ,</strong><br />Des erreurs risquent d'arriver si vous tentez des imports ou exports !

source: Available MO files:
fr_fr: Fichiers MO dispo :

source: External file xd-style.css for dashboard (flags, customization)
fr_fr: Fichier xd-style.css pour le tableau de bord (drapeau, personnalisation)

source: There is no style for dashboard
fr_fr: Il n'y a de style pour le tableau de bord

source: No style for dashboard
fr_fr: Pas de style

source: Activate style for dashboard
fr_fr: Activer le style

source: Dictionary Styles
fr_fr: Style du dictionnaire

source: Change style mode
fr_fr: Changer le type de style

source: Capabilities for editor role
fr_fr: Capacités pour le rôle éditeur

source: Here, as admin, set capabilities of the editor role:
fr_fr: En tant qu'admin, affecter les capacités du role éditeur :

source: No capability
fr_fr: Aucune capacité

source: Editor can edit MSGs
fr_fr: Le role éditeur peut modifier les MSGs

source: Can edit MSGs and save local-xx_XX.mo
fr_fr: Peut éditer les MSGs et sauver en local-xx_XX.mo

source: Update Role…
fr_fr: Mettre à jour le role…

source: Note:
fr_fr: Note et message :

source: Mail to dev.xiligroup
fr_fr: Courriel pour dev.xiligroup

source: Cc: (Reply to:)
fr_fr: Cc: (Répondre à :)

source: When checking and giving detailled infos, support will be better !
fr_fr: En cochant et en donnant des infos détaillées, le support sera meilleur !

source: Type of webmaster:
fr_fr: Type de webmestre :

source: Define your experience as webmaster…
fr_fr: Definissez votre expérience de webmestre…

source: Newbie in WP
fr_fr: Apprenti en WP

source: Good knowledge in WP and few in php
fr_fr: Bonne connaissance en WP et peu en php

source: Good knowledge in WP, CMS and good in php
fr_fr: Bonne connaissance en WP, en CMS et bonne en php

source: WP theme and /or plugin developper
fr_fr: Développeur de thème et/ou d'extension WP

source: Subject:
fr_fr: Sujet :

source: Choose topic...
fr_fr: Choisir la thématique...

source: Support need
fr_fr: Support attendu

source: Your message here…
fr_fr: Votre message ici... (soyez précis svp)

source: Before send the mail, check the infos to be sent and complete textarea. A copy (Cc:) is sent to webmaster email (modify it if needed) .
fr_fr: Avant d'envoyer le courriel, soyez précis, cocher les infos à envoyer au support et compléter les autres champs. Une copie est envoyée au webmestre (courriel à modifier si nécessaire) .

source: Send email
fr_fr: Envoyer le courriel

source: Uncommon filename
fr_fr: Fichier non conforme

source: Site's values
fr_fr: Données du site

source: xili-dictionary msgid list updated with %1$s terms - %2$s name(s) and %3$s description(s) -
fr_fr: Dans xili-dictionary, la liste des msgids a été mise à jour avec des termes de la taxinomie %1$s soit %2$s nom(s) et %3$s description(s).

source: Security check
fr_fr: Contrôle de sécurité

source: Xili-dictionary tool to prepare translation
fr_fr: Lien et action pour préparer les traductions avec xili-dictionary

source: %3$s terms of %1$s were just imported, <a href="%2$s">display those terms</a> in msg list of xili-dictionary.
fr_fr: %3$s termes de la taxinomie %1$s ont été importés, <a href="%2$s">afficher ces termes</a> dans la liste des msgids de xili-dictionary.

source: All %1$s terms are checked , <a href="%2$s">display those terms</a> in xili-dictionary.
fr_fr: Les termes des %1$s sont testés, les <a href="%2$s">afficher</a> dans xili-dictionary.

source: <a href="%2$s">Refresh</a> %3$s column of %1$s table.
fr_fr: <a href="%2$s">Rafraichir</a> la colonne %3$s de la table %1$s.

source: Language
fr_fr: Langue

source: %1$s terms can be imported inside xili-dictionary msgid list
fr_fr: Les termes des %1$s peuvent être transférés dans la liste des msgids de xili-dictionary

source: Import %1$s terms
fr_fr: Transférer les termes des %1$s

source: In the term listed below, %d items are displayed (each has a name and a description) :
fr_fr: Dans la liste ci-dessous, %d éléments sont affichés (chacun ayant un nom et une description) :

source: Display these %s terms in xili-dictionary
fr_fr: Afficher ces termes des %s dans xili-dictionary

source: None of these %d terms are available in the msgid list of xili-dictionary. Click button above to populate dictionary before you will translate.
fr_fr: Aucun de ces %d termes n'est présent dans la liste msgid de xili-dictionary. Cliquer le bouton ci-dessus pour compléter le dictionnaire avant de faire les traductions.

source: To display name and description of this term in msgid list
fr_fr: Pour afficher le nom et la description de ce terme dans la liste des msgid de XD.

source: Display in XD
fr_fr: Afficher dans XD

source: File is ready for download:
fr_fr: Fichier prêt à être téléchargé :

source: Impossible to download file
fr_fr: Impossible de télécharger le fichier

source: Please specify language
fr_fr: Spécifier le langage

source: Download files (.po, .pot, .mo) to your computer
fr_fr: Télécharger les fichiers (.po, .pot, .mo) sur votre ordinateur

source: Parent theme
fr_fr: Thème parent

source: Child theme
fr_fr: Thème enfant

source: from
fr_fr: du

source: Click here to download file %s
fr_fr: Cliquer ici pour télécharger le fichier %s

source: <a href="%s">Back</a> to the list of msgs and tools
fr_fr: <a href="%s">Retour</a> à la liste des messages et aux outils

source: Prepare download
fr_fr: Préparer à télécharger

source: Download the files
fr_fr: Téléchargement des fichiers

source: Define the file to download
fr_fr: Décrire le fichier à télécharger

source: Here it is possible to choose a language file of the current theme to download to your computer for further works or archives.
fr_fr: Cet écran permet de choisir les fichiers langage du thème courant à télécharger sur votre ordinateur pour traitement avec vos outils ou pour archivage.

source: Select type...
fr_fr: Choisir le type...

source: PO file
fr_fr: Fichier PO

source: MO file
fr_fr: Fichier MO

source: POT file
fr_fr: Fichier POT

source: Type of the file (.mo, .po or .pot)
fr_fr: Type de fichier ( .mo, .po ou .pot )

source: Subtype of file
fr_fr: Sous type de fichier

source: Subtype of the file (theme or local ?)
fr_fr: Sous type de fichier (thème ou local ?)

source: Select language
fr_fr: Sélectionner la langue

source: no language (pot)
fr_fr: pas de langue (pot)

source: Language of the file.
fr_fr: Langue du fichier.

source: Place of file
fr_fr: Place du fichier

source: Place of the file (parent or child theme)
fr_fr: Emplacement du fichier (thème parent ou enfant)

source: Compression of file
fr_fr: Compression du fichier

source: No compression
fr_fr: Sans compression

source: Type of compression...
fr_fr: Type de compression…

source: The wanted file do not exist ! Try another selection (language ?) !
fr_fr: Le fichier attendu n’existe pas ! Essayer une autre sélection (langue ?) !

source: Here it now possible to erase your dictionary (here in WP database) after creating the .mo files (and saving the .po files which is readable with any text editor). <strong>This erasing process don't delete the .mo or .po files.</strong>
fr_fr: Ici, il est possible de supprimer tout ou partie des termes du dictionnaire qui sont stockés dans la base après avoir créé les fichiers .mo (et après avoir sauvé les fichiers .po - fichiers lisibles avec un éditeur de texte - ). <strong>Ces suppressions de la base ne suppriment pas les fichiers .mo or .po .</strong>

source: Terms (msgid / msgstr) to erase
fr_fr: Termes (msgid / msgstr) à effacer

source: Original (msgid) and translations or Select language...
fr_fr: Original (msgid) et traductions ou Sélectionner la langue...

source: Translations (msgstr) in all languages
fr_fr: Traductions (msgstr) dans toutes les langues

source: Translations (msgstr) in %s
fr_fr: Traductions (msgstr) en %s

source: Language of the translated terms to be erased. Without selection, Original (msgid) AND translation (msgstr) will both be erased.
fr_fr: Langue des termes traduits à supprimer. Sans sélection, les termes originaux (msgid) ET leurs traductions (msgstr) seront supprimés simultanément.

source: Check Origin(s) to be erased
fr_fr: Cocher selon les origines à supprimer

source: Origins of the msgs to be erased. Without selection, msg without origin will be erased
fr_fr: Origines des msgs à supprimer. Sans sélection, tous les messages sont supprimés

source: Locale msgs only
fr_fr: Msgs locaux seulement

source: Erase only locale msgs (as saved in local-xx_YY files)
fr_fr: Ne supprime que les msgs locaux (comme ceux sauvés dans les fichiers local-xx_YY)

source: Number of entries in one step
fr_fr: Nombre d'entrées à chaque étape

source: second(s) delay between each group of rows
fr_fr: seconde(s) de délai entre chaque groupe de lignes

source: Keep this high to prevent too-many-connection issues.
fr_fr: A laisser élevé pour prévenir un trop grand nombre de connexions.

source: Erasing the dictionary
fr_fr: Nettoyage du dictionnaire

source: What to erase ?
fr_fr: Que supprimer ?

source: Processing...
fr_fr: Déroulement...

source: Erasing Dictionary lines
fr_fr: Suppression des lignes du dictionnaire

source: Start erasing
fr_fr: Démarrer la suppression

source: Stop
fr_fr: Arrêter

source: Lines found ! ( %2$s lines)
fr_fr: Lignes trouvées ! ( %2$s lignes)

source: No msgs to erase
fr_fr: Pas de msgs à supprimer

source: No more msgs to erase (%s)
fr_fr: Plus de msg à supprimer (%s)

source: No msgs to erase (%s)
fr_fr: Pas de msgs à supprimer (%s)

source: Erasing msgs (%1$s - %2$s)
fr_fr: Suppression des msgs en cours (%1$s - %2$s)

source: Erasing Complete (%1$s)
fr_fr: Suppression terminée (%1$s)

source: For more information:
fr_fr: Pour plus d'information :

source: <a href="http://wiki.xiligroup.org" target="_blank">Xili Plugins Documentation and WIKI</a>
fr_fr: <a href="http://wiki.xiligroup.org" target="_blank">Wiki de l'extension xili-dictionary</a>

source: <a href="http://wordpress.org/plugins/xili-dictionary/" target="_blank">Xili-dictionary Plugin Documentation</a>
fr_fr: <a href="http://wordpress.org/plugins/xili-dictionary/" target="_blank">Documentation de l’extension xili-dictionary</a>

source: <a href="http://codex.wordpress.org/" target="_blank">WordPress Documentation</a>
fr_fr: <a href="http://codex.wordpress.org/" target="_blank">Documentation WordPress (codex)</a>

source: <a href="http://dev.xiligroup.com/?post_type=forum" target="_blank">Support Forums</a>
fr_fr: <a href="http://dev.xiligroup.com/?post_type=forum" target="_blank">Forum Support</a>

source: xili-dictionary is a plugin (compatible with xili-language) to build a multilingual dictionary saved in the post tables of WordPress as custom post type (%s). With this dictionary, it is possible to create and update .mo file in the current theme folder. And more...
fr_fr: l’extension xili-dictionary est destinée à créer et mettre à jour les fichiers .mo (et .po aussi) du thème courant. Elle est utile pour les thèmes internationaux ou les thèmes multilingues 'live' pilotés par xili-language. Les éléments sont stockés dans les custom post type (%s) des tables de WP.

source: Things to remember to set xili-dictionary:
fr_fr: Eléments à retenir pour paramétrer xili-dictionary :

source: Verify that the theme is localizable (like WP bundled themes from twentyten to twentyfourteen).
fr_fr: Vérifier que le thème utilisé soit bien localisable (comme les thèmes WP du kit, de twentyten à twentyfourteen).

source: Define the list of targeted languages.
fr_fr: Définir la liste des langues utilisées.

source: Prepare a sub-folder like /languages/ for .po and .mo files in each language (use the default delivered with the theme or add the pot of the theme and put them inside.
fr_fr: Dans le dossier du thème, préparer un sous-dossier pour les fichiers .po et .mo de chaque langue (utiliser les fichiers livrés par défaut avec le thème ou ajouter son .pot et insérer les dedans.

source: If you have files: import them to create a base dictionary. If not : add a term or use buttons import and/or build in metabox.
fr_fr: Si vous avez ces fichiers : importer les pour créer la base initiale du dictionnaire. Sinon, ajouter un terme ou importer les données du site via les boutons de la fenêtre latérale - Importer et Générer.

source: For xili-language, xili-dictionary creates local-xx_YY files (like local-fr_FR for french) containing customized website inputs to avoid mixing with items of the theme itself. .mo is the file used and .po is the text form.
fr_fr: Pour l’utilisation avec xili-language, xili-dictionary crée des fichiers local-xx_YY (comme local-fr_FR pour le français) qui contiennent les entrées personnalisées du site web. Ceci afin d'éviter le mélange avec les données du thème proprement dit. Le suffixe .mo est le fichier utilisable et le .po en est sa forme sous texte lisible.

source: About xili-dictionary
fr_fr: A propos de xili-dictionary©

source: For more infos
fr_fr: Pour plus d'information

source: Things to remember about the list of translations (msgstr) of term (msgid) with xili-dictionary:
fr_fr: Eléments à retenir concernant la liste des traductions (msgstr) des termes (msgid) avec xili-dictionary :

source: Column Metas give infos about type of msg and his language
fr_fr: La colonne Métas donne des infos sur le type des msg et leur langue

source: Links in Metas redirect to msg in another language if translation exists.
fr_fr: Les liens dans les Métas donne accès direct aux msg dans une autre traduction si elle existe.

source: It is possible to filter according language or the Origin of msg.
fr_fr: Il est possible de sous-sélectionner selon la langue ou l'origine du msg.

source: When type of MSG is ‘local’, the couple msgid/msgstr is saved in a local-xx_YY file of current theme. This translation overhides all the others.
fr_fr: Quand le type d'un MSG est spécifié comme ‘local’, le couple msgid/msgstr est généré dans le fichier local-xx_YY du thème courant. Cette traduction va remplacer les autres.

source: Look %1$s this page %2$s to find a dynamic full list and more tools.
fr_fr: Voir %1$s cette page %2$s pour découvrir une liste dynamique des msgs et plus d’outils.

source: About MSG list page
fr_fr: A propos de la liste des MSGs

source: Things to remember before to create or edit a new translation (msgstr) or a term (msgid) with xili-dictionary:
fr_fr: Eléments à retenir avant de créer ou modifier une nouvelle traduction (msgstr) ou un nouveau terme de référence (msgid) avec xili-dictionary :

source: As in po files, msgid must be unique if no context is specified.
fr_fr: Comme dans un fichier po, un msgid doit être unique sauf si le contexte est définie.

source: msgstr is attached (taxonomy) to a language.
fr_fr: un msgstr est attaché à une langue (taxonomy).

source: if msgstr is edited, the box with msg series show untranslated msg.
fr_fr: si un msgstr est édité, la fenêtre Série de msg indique ceux qui restent à traduire.

source: How to update mo files ?
fr_fr: Comment mettre à jour les fichiers .mo ?

source: if msgstr is edited, the box - shortcuts to update mo files - is available to quickly update local-xx_YY.mo file w/o going to %s page.
fr_fr: si un msgstr est édité, la fenêtre - Raccourcis - est disponible pour mettre à jour rapidement les fichiers local-xx_YY.mo sans aller à la page %s.

source: Tools
fr_fr: Boite à outils

source: The language of mo file is here the language of msgstr being edited.
fr_fr: La langue du fichier est celle du msgstr en cours d'édition.

source: Look %1$s this page %2$s to find more tools.
fr_fr: Voir %1$s cette page %2$s pour découvrir plus d’outils.

source: About MSG edit
fr_fr: A propos de l'édition des MSGs

source: Things to remember to insert terms of category in dictionary msg list:
fr_fr: Eléments à retenir pour l'insertion des termes de catégorie dans les msgs de xili-dictionary :

source: Import Categories terms button: Transfer / import terms (name, description) as msg in dictionary.
fr_fr: Bouton : Transférer les termes : transfert des termes (nom, description) des catégories dans le dictionnaire comme msg.

source: Display this Categories Terms button: Switch to list of these msgs in dictionary.
fr_fr: Bouton : Afficher ces termes des Catégories : Voir la liste de ces msgs dans le dictionnaire.

source: In table, column Language:.
fr_fr: Dans la table, colonne Langue :.

source: Indications if terms are present in .mo files.
fr_fr: Indications sur la présence des termes (msg) dans les fichiers .mo.

source: Display in XD button: Show only name and description of the selected category in XD msg list.
fr_fr: Bouton - Afficher dans XD : Affiche seulement le nom et la description de cette catégorie dans la liste des msgs de XD.

source: Find more infos in forum and wiki.
fr_fr: Trouver d'autres infos dans les forums et le wiki.

source: <a href="%s" target="_blank">Xili Wiki Documentation</a>
fr_fr: <a href="%s" target="_blank"> Documentation Wiki des extensions Xili</a>

source: About %s dictionary tools
fr_fr: %s : à propos de l'outil dictionary

source: Things to remember about Origin in xili-dictionary
fr_fr: Eléments à retenir concernant l’origine avec xili-dictionary

source: Origin is a taxonomy to describe the origin of a msgid. So it is possible to share a msg between several theme and rebuild a new language file.
fr_fr: Origin est une taxinomie pour affecter l’origine d’un msgid. Ainsi, il est possible de partager un msg entre différents thèmes et de générer des nouveaux fichiers langue.

source: To manage language file from a plugin, it is important to have only one origin per plugin. The plugin uses this origin to know from where is the msg and to build in the good sub-folder the language file (mo or po).
fr_fr: Pour gérer les fichiers langue d’une extension, il est obligatoire de n’avoir qu’une origine par extension. Xili-dictionary utilise cette origine pour déterminer les messages à sélectionner et pour trouver les dossiers où sont ces fichiers.

source: In multisite context (WordPress Network), only superadmin can save language files to plugin folder.
fr_fr: Dans le contexte multisite (WordPress Network), seul le superadmin pourra générer les fichiers langages dans le dossier de l'extension.

source: About %s dictionary origins
fr_fr: A propos de l’origine dans %s dictionary

source: Things to remember about Writer in xili-dictionary
fr_fr: Eléments à retenir concernant les rédacteurs avec xili-dictionary

source: Writer is a hierarchic taxonomy to describe writer or translator of a msg. It can be used as is.
fr_fr: Writer est une taxinomie pour décrire les rédacteurs et traducteurs des MSG.

source: The hierarchy can be used to group like in office or by language.
fr_fr: La hiérarchie peut servir à grouper les rédacteurs par bureau ou par langage.

source: More settings in next releases.
fr_fr: Plus de détails dans les prochaines versions.

source: About %s dictionary writers
fr_fr: A propos des rédacteurs dans %s dictionary

source: Things to remember about scanning source files and importing inside xili-dictionary
fr_fr: Eléments à retenir concernant l'exploration des fichiers source et de l'importation dans xili-dictionary

source: Here, you can scan files from the current theme or a selected plugin to import translatable entries (terms) in dictionary.
fr_fr: Il est ici possible d'explorer les fichiers source et d'importer les éléments (termes) traduisibles dans le dictionnaire.

source: Each msg (id) become a “custom post type xdmsg” and ready to be translated. Use this way only if the author do not provide po or pot files.
fr_fr: Chaque msgid devient un “custom post type xdmsg” et est prêt à être traduit. N'utiliser cette approche que si l'auteur ne fournit pas de fichiers po ou pot.

source: Msgid attributes are filled with Origin (theme or plugin) and comments available in sources to help translation.
fr_fr: Chaque msgid est associé à des attributs (Origine, langue, commentaires,...) et des commentaires mis à disposition dans les sources pour aider la traduction.

source: If you want to create a pot file just check the option. This file will be saved in the language sub-folder.
fr_fr: Si vous souhaitez créer une copie de l'extraction sour forme de fichier .pot, cochez l'option. Ce fichier est sauvé dans le sous-dossier language.

source: During scanning process, a temporary window appears at bottom of the screen with some progressing infos.
fr_fr: Pendant la phase d'exploration et d'importation, une fenêtre temporaire apparaît en bas d'écran et affiche des informations du processus.

source: About scanning source files with %s dictionary
fr_fr: A propos de l'exploration des fichiers source dans %s dictionary

source: Things to remember about importing mo/po files in xili-dictionary
fr_fr: Eléments à retenir concernant l’importation des fichiers po/mo avec xili-dictionary

source: Importing process inserts po/mo files contents inside dictionary. Each msg (id or str) become a “custom post type xdmsg”.
fr_fr: Le processus d’importation insère les couples msgid/msgstr des fichiers po/mo dans le dictionnaire. Chaque msg (id ou str) devient un “custom post type xdmsg”.

source: Files are coming from current theme or installed plugin languages folders.
fr_fr: Les fichiers proviennent du thème courant ou des extensions installées.

source: Msg attributes are filled with Origin, language, comment infos. A msgstr is linked to his msgid if it is a translation.
fr_fr: Chaque MSG est associé à des attributs (Origine, langue, commentaires,...) Un MSGSTR est lié à un MSGID s'il en est la traduction.

source: During importing process, a temporary window appears at bottom of the screen with some progressing infos.
fr_fr: Pendant la phase d'importation, une fenêtre temporaire apparaît en bas d'écran et elle affiche des informations successives.

source: About %s dictionary files importing
fr_fr: A propos de l'importation des fichiers dans %s dictionary

source: Things to remember about download language files with xili-dictionary
fr_fr: Eléments à retenir concernant le téléchargement de fichier avec xili-dictionary

source: With this screen, it is possible to choose a language file (.mo or .po) to download to your computer. Useful for further works or archiving.
fr_fr: Cet écran permet de choisir les fichiers langage (.mo or .po) à télécharger sur votre ordinateur pour traitement avec vos outils ou pour archivage.
